# GetBoundarySize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..GetBoundarySize Method
StructuralSection Class See Also
---
Returns size of the section boundary.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public UV GetBoundarySize()
```

Visual Basic
---
```text
Public Function GetBoundarySize As UV
```

Visual C++
---
```text
public:
UV^ GetBoundarySize()
```

# ### Return Value
Size of the section boundary.
# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace